#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.repository_nuxt_web["cargo-shipper"].github_actions_environment_variable.environment_variable["demo|AWS_CLOUDFRONT_DISTRIBUTION"] will be created
  + resource "github_actions_environment_variable" "environment_variable" {
      + created_at    = (known after apply)
      + environment   = "demo"
      + id            = (known after apply)
      + repository    = "web-cargo-shipper"
      + updated_at    = (known after apply)
      + value         = "EC6DBI73KDZ9O"
      + variable_name = "AWS_CLOUDFRONT_DISTRIBUTION"
    }

  # module.repository_nuxt_web["cargo-shipper"].github_actions_environment_variable.environment_variable["production|AWS_CLOUDFRONT_DISTRIBUTION"] will be destroyed
  # (because key ["production|AWS_CLOUDFRONT_DISTRIBUTION"] is not in for_each map)
  - resource "github_actions_environment_variable" "environment_variable" {
      - created_at    = "2023-04-17 23:47:00 +0000 UTC" -> null
      - environment   = "production" -> null
      - id            = "web-cargo-shipper:production:AWS_CLOUDFRONT_DISTRIBUTION" -> null
      - repository    = "web-cargo-shipper" -> null
      - updated_at    = "2023-04-17 23:47:00 +0000 UTC" -> null
      - value         = "E134L2OOWNMG4H" -> null
      - variable_name = "AWS_CLOUDFRONT_DISTRIBUTION" -> null
    }

  # module.repository_nuxt_web["cargo-shipper"].github_actions_environment_variable.environment_variable["staging|AWS_CLOUDFRONT_DISTRIBUTION"] will be destroyed
  # (because key ["staging|AWS_CLOUDFRONT_DISTRIBUTION"] is not in for_each map)
  - resource "github_actions_environment_variable" "environment_variable" {
      - created_at    = "2023-04-17 23:46:58 +0000 UTC" -> null
      - environment   = "staging" -> null
      - id            = "web-cargo-shipper:staging:AWS_CLOUDFRONT_DISTRIBUTION" -> null
      - repository    = "web-cargo-shipper" -> null
      - updated_at    = "2023-04-17 23:46:58 +0000 UTC" -> null
      - value         = "EVMCVI5OJORTD" -> null
      - variable_name = "AWS_CLOUDFRONT_DISTRIBUTION" -> null
    }

  # module.repository_nuxt_web["cargo-shipper"].github_repository_environment.env["demo"] will be updated in-place
  ~ resource "github_repository_environment" "env" {
        id          = "web-cargo-shipper:demo"
        # (2 unchanged attributes hidden)

      ~ deployment_branch_policy {
          ~ custom_branch_policies = false -> true
          ~ protected_branches     = true -> false
        }
    }

  # module.repository_nuxt_web["cargo-shipper"].github_repository_environment.env["dev"] will be updated in-place
  ~ resource "github_repository_environment" "env" {
        id          = "web-cargo-shipper:dev"
        # (2 unchanged attributes hidden)

      ~ deployment_branch_policy {
          ~ custom_branch_policies = false -> true
          ~ protected_branches     = true -> false
        }
    }

  # module.repository_nuxt_web["cargo-shipper"].github_repository_environment.env["production"] will be updated in-place
  ~ resource "github_repository_environment" "env" {
        id          = "web-cargo-shipper:production"
        # (2 unchanged attributes hidden)

      ~ deployment_branch_policy {
          ~ custom_branch_policies = false -> true
          ~ protected_branches     = true -> false
        }
    }

  # module.repository_nuxt_web["cargo-shipper"].github_repository_environment.env["staging"] will be updated in-place
  ~ resource "github_repository_environment" "env" {
        id          = "web-cargo-shipper:staging"
        # (2 unchanged attributes hidden)

      ~ deployment_branch_policy {
          ~ custom_branch_policies = false -> true
          ~ protected_branches     = true -> false
        }
    }

  # module.repository_nuxt_web["cargo-shipper"].github_repository_file.files[".github/workflows/build-and-deploy.yml"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/nuxt-web/.github/workflows/build-and-deploy.yml
            
            name: Build and deploy
            
            on:
              workflow_call:
                inputs:
                  node-version:
                    required: true
                    type: string
                    description: "The node version to use for node setup"
                  environment:
                    required: true
                    type: string
                    description: "Environment to deploy to"
            
            jobs:
              build-and-deploy:
                runs-on: ubuntu-latest
                timeout-minutes: 10
                environment: ${{ inputs.environment }}
                permissions:
                  id-token: write
                  contents: read
                env:
                  AWS_S3_BUCKET: s3-${{ vars.ENVIRONMENT_ABBR }}-${{ vars.APP }}.${{ vars.DOMAIN }}
                steps:
                  - name: Checkout
                    uses: actions/checkout@v2
                  - name: Set up node ${{ inputs.node-version }}
                    uses: actions/setup-node@v2
                    with:
                      node-version: ${{ inputs.node-version }}
                      cache: yarn
                  - name: Install dependencies
          +         env:
          +           GOOGLE_CLIENTID: ${{ secrets.GOOGLE_CLIENTID }}
                    run: yarn install --frozen-lockfile
                  - name: Configure AWS Credentials
                    uses: aws-actions/configure-aws-credentials@v1
                    with:
                      role-to-assume: "arn:aws:iam::${{ secrets.AWS_ACCOUNT }}:role/${{ vars.ENVIRONMENT_ABBR }}-GitHubActionsWebsite"
                      role-session-name: "github-actions-${{ github.event.repository.name }}-deploy"
                      aws-region: "${{ vars.AWS_REGION }}"
                  - name: Build
          +         env:
          +           GOOGLE_CLIENTID: ${{ secrets.GOOGLE_CLIENTID }}
                    run: yarn generate
                  - name: Deploy to ${{ inputs.environment }} S3
                    id: sync_s3
                    run: |
                      aws s3 sync "./dist/img/" "s3://${{ env.AWS_S3_BUCKET }}/img/" --delete --size-only
                      aws s3 sync "./dist/" "s3://${{ env.AWS_S3_BUCKET }}/" --exclude "./dist/img"
                outputs:
                  files_changed: "${{ steps.build-and-deploy.outputs.files_changed }}"
        EOT
        id                  = "web-cargo-shipper/.github/workflows/build-and-deploy.yml"
        # (8 unchanged attributes hidden)
    }

  # module.repository_nuxt_web["cargo-shipper"].github_repository_file.files[".github/workflows/deploy-dev.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/nuxt-web/.github/workflows/deploy-dev.yml
            
            name: Deploy Develop
            
            on:
              pull_request:
                branches:
                  - staging
              workflow_dispatch:
            
            jobs:
              build-and-deploy:
                uses: ./.github/workflows/build-and-deploy.yml
                with:
                  node-version: 21.x
                  environment: develop
                secrets: inherit
                permissions:
                  id-token: write
                  contents: read
        EOT
      + file                = ".github/workflows/deploy-dev.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "web-cargo-shipper"
      + sha                 = (known after apply)
    }

  # module.repository_nuxt_web["cargo-shipper"].github_repository_file.files[".github/workflows/deploy-dmo.yml"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/nuxt-web/.github/workflows/deploy-dmo.yml
            
            name: Deploy Demo
            
            on:
              workflow_dispatch:
            
            jobs:
              build-and-deploy:
                uses: ./.github/workflows/build-and-deploy.yml
                with:
          -       node-version: 19.x
          +       node-version: 21.x
                  environment: demo
                secrets: inherit
                permissions:
                  id-token: write
                  contents: read
          + 
          +   invalidate-cloudfront:
          +     uses: ./.github/workflows/invalidate-cloudfront.yml
          +     needs: [build-and-deploy]
          +     with:
          +       paths: "/*"
          +       environment: demo
          +     secrets: inherit
          +     permissions:
          +       id-token: write
          +       contents: read
        EOT
        id                  = "web-cargo-shipper/.github/workflows/deploy-dmo.yml"
        # (8 unchanged attributes hidden)
    }

  # module.repository_nuxt_web["cargo-shipper"].github_repository_file.files[".github/workflows/deploy-prd.yml"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            ## This file was provisioned by Terraform
            ## File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/nuxt-web/.github/workflows/deploy-prd.yml
            
            name: Deploy Production
            
            on:
              push:
                branches:
                  - main
              workflow_dispatch:
            
            jobs:
              build-and-deploy:
                uses: ./.github/workflows/build-and-deploy.yml
                with:
          -       node-version: 19.x
          +       node-version: 21.x
                  environment: production
                secrets: inherit
                permissions:
                  id-token: write
                  contents: read
            
              invalidate-cloudfront:
                uses: ./.github/workflows/invalidate-cloudfront.yml
                needs: [build-and-deploy]
                with:
                  paths: "/*"
                  environment: production
                secrets: inherit
                permissions:
                  id-token: write
                  contents: read
        EOT
        id                  = "web-cargo-shipper/.github/workflows/deploy-prd.yml"
        # (8 unchanged attributes hidden)
    }

  # module.repository_nuxt_web["cargo-shipper"].github_repository_file.files[".github/workflows/deploy-stg.yml"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/nuxt-web/.github/workflows/deploy-stg.yml
            
            name: Deploy Staging
            
            on:
              push:
                branches:
                  - staging
              workflow_dispatch:
            
            jobs:
              build-and-deploy:
                uses: ./.github/workflows/build-and-deploy.yml
                with:
          -       node-version: 19.x
          +       node-version: 21.x
                  environment: staging
                secrets: inherit
                permissions:
                  id-token: write
                  contents: read
            
              invalidate-cloudfront:
                uses: ./.github/workflows/invalidate-cloudfront.yml
                needs: [build-and-deploy]
                with:
                  paths: "/*"
                  environment: staging
                secrets: inherit
                permissions:
                  id-token: write
                  contents: read
        EOT
        id                  = "web-cargo-shipper/.github/workflows/deploy-stg.yml"
        # (8 unchanged attributes hidden)
    }

  # module.repository_nuxt_web["cargo-shipper"].github_repository_file.files["LICENSE"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            Business Source License 1.1
            
            License text copyright (c) 2017 MariaDB Corporation Ab, All Rights Reserved.
            "Business Source License" is a trademark of MariaDB Corporation Ab.
            
            -----------------------------------------------------------------------------
            
            Parameters
            
            Licensor:             Arrow DAO
            
            Licensed Work:        Arrow Services
                                  The Licensed Work is (c) 2022 Arrow DAO
            
            Additional Use Grant: Limited production uses, or as otherwise permitted by
                                  Arrow DAO governance vote
            
            Change Date:          for each release of web-cargo-shipper, the earlier of (i) two
                                  years from the release date, or (ii) a date specified at
                                  https://github.com/Arrow-air/web-cargo-shipper/blob/main/README.md
            
            Change License:       GNU Affero General Public License v3.0 or later
            
            -----------------------------------------------------------------------------
            
            Terms
            
            The Licensor hereby grants you the right to copy, modify, create derivative
            works, redistribute, and make non-production use of the Licensed Work. The
            Licensor may make an Additional Use Grant, above, permitting limited
            production use.
            
            Effective on the Change Date, or the fourth anniversary of the first publicly
            available distribution of a specific version of the Licensed Work under this
            License, whichever comes first, the Licensor hereby grants you rights under
            the terms of the Change License, and the rights granted in the paragraph
            above terminate.
            
            If your use of the Licensed Work does not comply with the requirements
            currently in effect as described in this License, you must purchase a
            commercial license from the Licensor, its affiliated entities, or authorized
            resellers, or you must refrain from using the Licensed Work.
            
            All copies of the original and modified Licensed Work, and derivative works
            of the Licensed Work, are subject to this License. This License applies
            separately for each version of the Licensed Work and the Change Date may vary
            for each version of the Licensed Work released by Licensor.
            
            You must conspicuously display this License on each original or modified copy
            of the Licensed Work. If you receive the Licensed Work in original or
            modified form from a third party, the terms and conditions set forth in this
            License apply to your use of that work.
            
            Any use of the Licensed Work in violation of this License will automatically
            terminate your rights under this License for the current and all other
            versions of the Licensed Work.
            
            This License does not grant you any right in any trademark or logo of
            Licensor or its affiliates (provided that you may use a trademark or logo of
            Licensor as expressly required by this License).
            
            TO THE EXTENT PERMITTED BY APPLICABLE LAW, THE LICENSED WORK IS PROVIDED ON
            AN "AS IS" BASIS. LICENSOR HEREBY DISCLAIMS ALL WARRANTIES AND CONDITIONS,
            EXPRESS OR IMPLIED, INCLUDING (WITHOUT LIMITATION) WARRANTIES OF
            MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, NON-INFRINGEMENT, AND
            TITLE.
            
            MariaDB hereby grants you permission to use this License’s text to license
            your works, and to refer to it using the trademark "Business Source License",
            as long as you comply with the Covenants of Licensor below.
            
            -----------------------------------------------------------------------------
            
            Covenants of Licensor
            
            In consideration of the right to use this License’s text and the "Business
            Source License" name and trademark, Licensor covenants to MariaDB, and to all
            other recipients of the licensed work to be provided by Licensor:
            
            1. To specify as the Change License the GPL Version 2.0 or any later version,
               or a license that is compatible with GPL Version 2.0 or a later version,
               where "compatible" means that software provided under the Change License can
               be included in a program with software provided under GPL Version 2.0 or a
               later version. Licensor may specify additional Change Licenses without
               limitation.
            
            2. To either: (a) specify an additional grant of rights to use that does not
               impose any additional restriction on the right granted in this License, as
               the Additional Use Grant; or (b) insert the text "None".
            
            3. To specify a Change Date.
            
            4. Not to modify this License in any other way.
            
            -----------------------------------------------------------------------------
            
            Notice
            
            The Business Source License (this document, or the "License") is not an Open
            Source license. However, the Licensed Work will eventually be made available
            under an Open Source License, as stated in this License.
        EOT
      + file                = "LICENSE"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "web-cargo-shipper"
      + sha                 = (known after apply)
    }

  # module.repository_nuxt_web["services-hangar"].github_actions_environment_variable.environment_variable["demo|AWS_CLOUDFRONT_DISTRIBUTION"] will be created
  + resource "github_actions_environment_variable" "environment_variable" {
      + created_at    = (known after apply)
      + environment   = "demo"
      + id            = (known after apply)
      + repository    = "web-services-hangar"
      + updated_at    = (known after apply)
      + value         = "E10MH4HC12EKI6"
      + variable_name = "AWS_CLOUDFRONT_DISTRIBUTION"
    }

  # module.repository_nuxt_web["services-hangar"].github_actions_environment_variable.environment_variable["production|AWS_CLOUDFRONT_DISTRIBUTION"] will be destroyed
  # (because key ["production|AWS_CLOUDFRONT_DISTRIBUTION"] is not in for_each map)
  - resource "github_actions_environment_variable" "environment_variable" {
      - created_at    = "2024-01-17 08:12:18 +0000 UTC" -> null
      - environment   = "production" -> null
      - id            = "web-services-hangar:production:AWS_CLOUDFRONT_DISTRIBUTION" -> null
      - repository    = "web-services-hangar" -> null
      - updated_at    = "2024-01-17 08:12:18 +0000 UTC" -> null
      - value         = "E134L2OOWNMG4H" -> null
      - variable_name = "AWS_CLOUDFRONT_DISTRIBUTION" -> null
    }

  # module.repository_nuxt_web["services-hangar"].github_repository_file.files[".github/workflows/deploy-dmo.yml"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/nuxt-web/.github/workflows/deploy-dmo.yml
            
            name: Deploy Demo
            
            on:
              workflow_dispatch:
            
            jobs:
              build-and-deploy:
                uses: ./.github/workflows/build-and-deploy.yml
                with:
                  node-version: 21.x
                  environment: demo
                secrets: inherit
                permissions:
                  id-token: write
                  contents: read
          + 
          +   invalidate-cloudfront:
          +     uses: ./.github/workflows/invalidate-cloudfront.yml
          +     needs: [build-and-deploy]
          +     with:
          +       paths: "/*"
          +       environment: demo
          +     secrets: inherit
          +     permissions:
          +       id-token: write
          +       contents: read
        EOT
        id                  = "web-services-hangar/.github/workflows/deploy-dmo.yml"
        # (8 unchanged attributes hidden)
    }

  # module.repository_nuxt_web["services-hangar"].github_repository_file.files["LICENSE"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            Business Source License 1.1
            
            License text copyright (c) 2017 MariaDB Corporation Ab, All Rights Reserved.
            "Business Source License" is a trademark of MariaDB Corporation Ab.
            
            -----------------------------------------------------------------------------
            
            Parameters
            
            Licensor:             Arrow DAO
            
            Licensed Work:        Arrow Services
                                  The Licensed Work is (c) 2022 Arrow DAO
            
            Additional Use Grant: Limited production uses, or as otherwise permitted by
                                  Arrow DAO governance vote
            
            Change Date:          for each release of web-services-hangar, the earlier of (i) two
                                  years from the release date, or (ii) a date specified at
                                  https://github.com/Arrow-air/web-services-hangar/blob/main/README.md
            
            Change License:       GNU Affero General Public License v3.0 or later
            
            -----------------------------------------------------------------------------
            
            Terms
            
            The Licensor hereby grants you the right to copy, modify, create derivative
            works, redistribute, and make non-production use of the Licensed Work. The
            Licensor may make an Additional Use Grant, above, permitting limited
            production use.
            
            Effective on the Change Date, or the fourth anniversary of the first publicly
            available distribution of a specific version of the Licensed Work under this
            License, whichever comes first, the Licensor hereby grants you rights under
            the terms of the Change License, and the rights granted in the paragraph
            above terminate.
            
            If your use of the Licensed Work does not comply with the requirements
            currently in effect as described in this License, you must purchase a
            commercial license from the Licensor, its affiliated entities, or authorized
            resellers, or you must refrain from using the Licensed Work.
            
            All copies of the original and modified Licensed Work, and derivative works
            of the Licensed Work, are subject to this License. This License applies
            separately for each version of the Licensed Work and the Change Date may vary
            for each version of the Licensed Work released by Licensor.
            
            You must conspicuously display this License on each original or modified copy
            of the Licensed Work. If you receive the Licensed Work in original or
            modified form from a third party, the terms and conditions set forth in this
            License apply to your use of that work.
            
            Any use of the Licensed Work in violation of this License will automatically
            terminate your rights under this License for the current and all other
            versions of the Licensed Work.
            
            This License does not grant you any right in any trademark or logo of
            Licensor or its affiliates (provided that you may use a trademark or logo of
            Licensor as expressly required by this License).
            
            TO THE EXTENT PERMITTED BY APPLICABLE LAW, THE LICENSED WORK IS PROVIDED ON
            AN "AS IS" BASIS. LICENSOR HEREBY DISCLAIMS ALL WARRANTIES AND CONDITIONS,
            EXPRESS OR IMPLIED, INCLUDING (WITHOUT LIMITATION) WARRANTIES OF
            MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, NON-INFRINGEMENT, AND
            TITLE.
            
            MariaDB hereby grants you permission to use this License’s text to license
            your works, and to refer to it using the trademark "Business Source License",
            as long as you comply with the Covenants of Licensor below.
            
            -----------------------------------------------------------------------------
            
            Covenants of Licensor
            
            In consideration of the right to use this License’s text and the "Business
            Source License" name and trademark, Licensor covenants to MariaDB, and to all
            other recipients of the licensed work to be provided by Licensor:
            
            1. To specify as the Change License the GPL Version 2.0 or any later version,
               or a license that is compatible with GPL Version 2.0 or a later version,
               where "compatible" means that software provided under the Change License can
               be included in a program with software provided under GPL Version 2.0 or a
               later version. Licensor may specify additional Change Licenses without
               limitation.
            
            2. To either: (a) specify an additional grant of rights to use that does not
               impose any additional restriction on the right granted in this License, as
               the Additional Use Grant; or (b) insert the text "None".
            
            3. To specify a Change Date.
            
            4. Not to modify this License in any other way.
            
            -----------------------------------------------------------------------------
            
            Notice
            
            The Business Source License (this document, or the "License") is not an Open
            Source license. However, the Licensed Work will eventually be made available
            under an Open Source License, as stated in this License.
        EOT
      + file                = "LICENSE"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "web-services-hangar"
      + sha                 = (known after apply)
    }

  # module.repository_nuxt_web["services-public"].github_actions_environment_variable.environment_variable["production|AWS_CLOUDFRONT_DISTRIBUTION"] will be updated in-place
  ~ resource "github_actions_environment_variable" "environment_variable" {
        id            = "web-services-public:production:AWS_CLOUDFRONT_DISTRIBUTION"
      ~ value         = "E134L2OOWNMG4H" -> "E1L4UUMXJM67HU"
        # (5 unchanged attributes hidden)
    }

  # module.repository_nuxt_web["services-public"].github_actions_environment_variable.environment_variable["staging|AWS_CLOUDFRONT_DISTRIBUTION"] will be created
  + resource "github_actions_environment_variable" "environment_variable" {
      + created_at    = (known after apply)
      + environment   = "staging"
      + id            = (known after apply)
      + repository    = "web-services-public"
      + updated_at    = (known after apply)
      + value         = "EVMCVI5OJORTD"
      + variable_name = "AWS_CLOUDFRONT_DISTRIBUTION"
    }

  # module.repository_nuxt_web["services-public"].github_repository_environment.env["demo"] will be updated in-place
  ~ resource "github_repository_environment" "env" {
        id          = "web-services-public:demo"
        # (2 unchanged attributes hidden)

      ~ deployment_branch_policy {
          ~ custom_branch_policies = false -> true
          ~ protected_branches     = true -> false
        }
    }

  # module.repository_nuxt_web["services-public"].github_repository_environment.env["dev"] will be updated in-place
  ~ resource "github_repository_environment" "env" {
        id          = "web-services-public:dev"
        # (2 unchanged attributes hidden)

      ~ deployment_branch_policy {
          ~ custom_branch_policies = false -> true
          ~ protected_branches     = true -> false
        }
    }

  # module.repository_nuxt_web["services-public"].github_repository_environment.env["production"] will be updated in-place
  ~ resource "github_repository_environment" "env" {
        id          = "web-services-public:production"
        # (2 unchanged attributes hidden)

      ~ deployment_branch_policy {
          ~ custom_branch_policies = false -> true
          ~ protected_branches     = true -> false
        }
    }

  # module.repository_nuxt_web["services-public"].github_repository_environment.env["staging"] will be updated in-place
  ~ resource "github_repository_environment" "env" {
        id          = "web-services-public:staging"
        # (2 unchanged attributes hidden)

      ~ deployment_branch_policy {
          ~ custom_branch_policies = false -> true
          ~ protected_branches     = true -> false
        }
    }

  # module.repository_nuxt_web["services-public"].github_repository_file.files[".github/workflows/build-and-deploy.yml"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/nuxt-web/.github/workflows/build-and-deploy.yml
            
            name: Build and deploy
            
            on:
              workflow_call:
                inputs:
                  node-version:
                    required: true
                    type: string
                    description: "The node version to use for node setup"
                  environment:
                    required: true
                    type: string
                    description: "Environment to deploy to"
            
            jobs:
              build-and-deploy:
                runs-on: ubuntu-latest
                timeout-minutes: 10
                environment: ${{ inputs.environment }}
                permissions:
                  id-token: write
                  contents: read
                env:
                  AWS_S3_BUCKET: s3-${{ vars.ENVIRONMENT_ABBR }}-${{ vars.APP }}.${{ vars.DOMAIN }}
                steps:
                  - name: Checkout
                    uses: actions/checkout@v2
                  - name: Set up node ${{ inputs.node-version }}
                    uses: actions/setup-node@v2
                    with:
                      node-version: ${{ inputs.node-version }}
                      cache: yarn
                  - name: Install dependencies
          +         env:
          +           GOOGLE_CLIENTID: ${{ secrets.GOOGLE_CLIENTID }}
                    run: yarn install --frozen-lockfile
                  - name: Configure AWS Credentials
                    uses: aws-actions/configure-aws-credentials@v1
                    with:
                      role-to-assume: "arn:aws:iam::${{ secrets.AWS_ACCOUNT }}:role/${{ vars.ENVIRONMENT_ABBR }}-GitHubActionsWebsite"
                      role-session-name: "github-actions-${{ github.event.repository.name }}-deploy"
                      aws-region: "${{ vars.AWS_REGION }}"
                  - name: Build
          +         env:
          +           GOOGLE_CLIENTID: ${{ secrets.GOOGLE_CLIENTID }}
                    run: yarn generate
                  - name: Deploy to ${{ inputs.environment }} S3
                    id: sync_s3
                    run: |
                      aws s3 sync "./dist/img/" "s3://${{ env.AWS_S3_BUCKET }}/img/" --delete --size-only
                      aws s3 sync "./dist/" "s3://${{ env.AWS_S3_BUCKET }}/" --exclude "./dist/img"
                outputs:
                  files_changed: "${{ steps.build-and-deploy.outputs.files_changed }}"
        EOT
        id                  = "web-services-public/.github/workflows/build-and-deploy.yml"
        # (8 unchanged attributes hidden)
    }

  # module.repository_nuxt_web["services-public"].github_repository_file.files[".github/workflows/deploy-dev.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/nuxt-web/.github/workflows/deploy-dev.yml
            
            name: Deploy Develop
            
            on:
              pull_request:
                branches:
                  - staging
              workflow_dispatch:
            
            jobs:
              build-and-deploy:
                uses: ./.github/workflows/build-and-deploy.yml
                with:
                  node-version: 21.x
                  environment: develop
                secrets: inherit
                permissions:
                  id-token: write
                  contents: read
        EOT
      + file                = ".github/workflows/deploy-dev.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "web-services-public"
      + sha                 = (known after apply)
    }

  # module.repository_nuxt_web["services-public"].github_repository_file.files[".github/workflows/deploy-dmo.yml"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/nuxt-web/.github/workflows/deploy-dmo.yml
            
            name: Deploy Demo
            
            on:
              workflow_dispatch:
            
            jobs:
              build-and-deploy:
                uses: ./.github/workflows/build-and-deploy.yml
                with:
          -       node-version: 19.x
          +       node-version: 21.x
                  environment: demo
                secrets: inherit
                permissions:
                  id-token: write
                  contents: read
          + 
          +   invalidate-cloudfront:
          +     uses: ./.github/workflows/invalidate-cloudfront.yml
          +     needs: [build-and-deploy]
          +     with:
          +       paths: "/*"
          +       environment: demo
          +     secrets: inherit
          +     permissions:
          +       id-token: write
          +       contents: read
        EOT
        id                  = "web-services-public/.github/workflows/deploy-dmo.yml"
        # (8 unchanged attributes hidden)
    }

  # module.repository_nuxt_web["services-public"].github_repository_file.files[".github/workflows/deploy-prd.yml"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            ## This file was provisioned by Terraform
            ## File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/nuxt-web/.github/workflows/deploy-prd.yml
            
            name: Deploy Production
            
            on:
              push:
                branches:
                  - main
              workflow_dispatch:
            
            jobs:
              build-and-deploy:
                uses: ./.github/workflows/build-and-deploy.yml
                with:
          -       node-version: 19.x
          +       node-version: 21.x
                  environment: production
                secrets: inherit
                permissions:
                  id-token: write
                  contents: read
            
              invalidate-cloudfront:
                uses: ./.github/workflows/invalidate-cloudfront.yml
                needs: [build-and-deploy]
                with:
                  paths: "/*"
                  environment: production
                secrets: inherit
                permissions:
                  id-token: write
                  contents: read
        EOT
        id                  = "web-services-public/.github/workflows/deploy-prd.yml"
        # (8 unchanged attributes hidden)
    }

  # module.repository_nuxt_web["services-public"].github_repository_file.files[".github/workflows/deploy-stg.yml"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/nuxt-web/.github/workflows/deploy-stg.yml
            
            name: Deploy Staging
            
            on:
              push:
                branches:
                  - staging
              workflow_dispatch:
            
            jobs:
              build-and-deploy:
                uses: ./.github/workflows/build-and-deploy.yml
                with:
          -       node-version: 19.x
          +       node-version: 21.x
                  environment: staging
                secrets: inherit
                permissions:
                  id-token: write
                  contents: read
            
              invalidate-cloudfront:
                uses: ./.github/workflows/invalidate-cloudfront.yml
                needs: [build-and-deploy]
                with:
                  paths: "/*"
                  environment: staging
                secrets: inherit
                permissions:
                  id-token: write
                  contents: read
        EOT
        id                  = "web-services-public/.github/workflows/deploy-stg.yml"
        # (8 unchanged attributes hidden)
    }

  # module.repository_nuxt_web["services-public"].github_repository_file.files["LICENSE"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            Business Source License 1.1
            
            License text copyright (c) 2017 MariaDB Corporation Ab, All Rights Reserved.
            "Business Source License" is a trademark of MariaDB Corporation Ab.
            
            -----------------------------------------------------------------------------
            
            Parameters
            
            Licensor:             Arrow DAO
            
            Licensed Work:        Arrow Services
                                  The Licensed Work is (c) 2022 Arrow DAO
            
            Additional Use Grant: Limited production uses, or as otherwise permitted by
                                  Arrow DAO governance vote
            
            Change Date:          for each release of web-services-public, the earlier of (i) two
                                  years from the release date, or (ii) a date specified at
                                  https://github.com/Arrow-air/web-services-public/blob/main/README.md
            
            Change License:       GNU Affero General Public License v3.0 or later
            
            -----------------------------------------------------------------------------
            
            Terms
            
            The Licensor hereby grants you the right to copy, modify, create derivative
            works, redistribute, and make non-production use of the Licensed Work. The
            Licensor may make an Additional Use Grant, above, permitting limited
            production use.
            
            Effective on the Change Date, or the fourth anniversary of the first publicly
            available distribution of a specific version of the Licensed Work under this
            License, whichever comes first, the Licensor hereby grants you rights under
            the terms of the Change License, and the rights granted in the paragraph
            above terminate.
            
            If your use of the Licensed Work does not comply with the requirements
            currently in effect as described in this License, you must purchase a
            commercial license from the Licensor, its affiliated entities, or authorized
            resellers, or you must refrain from using the Licensed Work.
            
            All copies of the original and modified Licensed Work, and derivative works
            of the Licensed Work, are subject to this License. This License applies
            separately for each version of the Licensed Work and the Change Date may vary
            for each version of the Licensed Work released by Licensor.
            
            You must conspicuously display this License on each original or modified copy
            of the Licensed Work. If you receive the Licensed Work in original or
            modified form from a third party, the terms and conditions set forth in this
            License apply to your use of that work.
            
            Any use of the Licensed Work in violation of this License will automatically
            terminate your rights under this License for the current and all other
            versions of the Licensed Work.
            
            This License does not grant you any right in any trademark or logo of
            Licensor or its affiliates (provided that you may use a trademark or logo of
            Licensor as expressly required by this License).
            
            TO THE EXTENT PERMITTED BY APPLICABLE LAW, THE LICENSED WORK IS PROVIDED ON
            AN "AS IS" BASIS. LICENSOR HEREBY DISCLAIMS ALL WARRANTIES AND CONDITIONS,
            EXPRESS OR IMPLIED, INCLUDING (WITHOUT LIMITATION) WARRANTIES OF
            MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, NON-INFRINGEMENT, AND
            TITLE.
            
            MariaDB hereby grants you permission to use this License’s text to license
            your works, and to refer to it using the trademark "Business Source License",
            as long as you comply with the Covenants of Licensor below.
            
            -----------------------------------------------------------------------------
            
            Covenants of Licensor
            
            In consideration of the right to use this License’s text and the "Business
            Source License" name and trademark, Licensor covenants to MariaDB, and to all
            other recipients of the licensed work to be provided by Licensor:
            
            1. To specify as the Change License the GPL Version 2.0 or any later version,
               or a license that is compatible with GPL Version 2.0 or a later version,
               where "compatible" means that software provided under the Change License can
               be included in a program with software provided under GPL Version 2.0 or a
               later version. Licensor may specify additional Change Licenses without
               limitation.
            
            2. To either: (a) specify an additional grant of rights to use that does not
               impose any additional restriction on the right granted in this License, as
               the Additional Use Grant; or (b) insert the text "None".
            
            3. To specify a Change Date.
            
            4. Not to modify this License in any other way.
            
            -----------------------------------------------------------------------------
            
            Notice
            
            The Business Source License (this document, or the "License") is not an Open
            Source license. However, the Licensed Work will eventually be made available
            under an Open Source License, as stated in this License.
        EOT
      + file                = "LICENSE"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "web-services-public"
      + sha                 = (known after apply)
    }

  # module.repository_nuxt_web["services-scanner"].github_repository_file.files[".github/workflows/build-and-deploy.yml"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/nuxt-web/.github/workflows/build-and-deploy.yml
            
            name: Build and deploy
            
            on:
              workflow_call:
                inputs:
                  node-version:
                    required: true
                    type: string
                    description: "The node version to use for node setup"
                  environment:
                    required: true
                    type: string
                    description: "Environment to deploy to"
            
            jobs:
              build-and-deploy:
                runs-on: ubuntu-latest
                timeout-minutes: 10
                environment: ${{ inputs.environment }}
                permissions:
                  id-token: write
                  contents: read
                env:
                  AWS_S3_BUCKET: s3-${{ vars.ENVIRONMENT_ABBR }}-${{ vars.APP }}.${{ vars.DOMAIN }}
                steps:
                  - name: Checkout
                    uses: actions/checkout@v2
                  - name: Set up node ${{ inputs.node-version }}
                    uses: actions/setup-node@v2
                    with:
                      node-version: ${{ inputs.node-version }}
                      cache: yarn
                  - name: Install dependencies
          +         env:
          +           GOOGLE_CLIENTID: ${{ secrets.GOOGLE_CLIENTID }}
                    run: yarn install --frozen-lockfile
                  - name: Configure AWS Credentials
                    uses: aws-actions/configure-aws-credentials@v1
                    with:
                      role-to-assume: "arn:aws:iam::${{ secrets.AWS_ACCOUNT }}:role/${{ vars.ENVIRONMENT_ABBR }}-GitHubActionsWebsite"
                      role-session-name: "github-actions-${{ github.event.repository.name }}-deploy"
                      aws-region: "${{ vars.AWS_REGION }}"
                  - name: Build
          +         env:
          +           GOOGLE_CLIENTID: ${{ secrets.GOOGLE_CLIENTID }}
                    run: yarn generate
                  - name: Deploy to ${{ inputs.environment }} S3
                    id: sync_s3
                    run: |
                      aws s3 sync "./dist/img/" "s3://${{ env.AWS_S3_BUCKET }}/img/" --delete --size-only
                      aws s3 sync "./dist/" "s3://${{ env.AWS_S3_BUCKET }}/" --exclude "./dist/img"
                outputs:
                  files_changed: "${{ steps.build-and-deploy.outputs.files_changed }}"
        EOT
        id                  = "web-services-scanner/.github/workflows/build-and-deploy.yml"
        # (8 unchanged attributes hidden)
    }

  # module.repository_nuxt_web["services-scanner"].github_repository_file.files[".github/workflows/deploy-dev.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/nuxt-web/.github/workflows/deploy-dev.yml
            
            name: Deploy Develop
            
            on:
              pull_request:
                branches:
                  - staging
              workflow_dispatch:
            
            jobs:
              build-and-deploy:
                uses: ./.github/workflows/build-and-deploy.yml
                with:
                  node-version: 21.x
                  environment: develop
                secrets: inherit
                permissions:
                  id-token: write
                  contents: read
        EOT
      + file                = ".github/workflows/deploy-dev.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "web-services-scanner"
      + sha                 = (known after apply)
    }

  # module.repository_nuxt_web["services-scanner"].github_repository_file.files[".github/workflows/deploy-dmo.yml"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/nuxt-web/.github/workflows/deploy-dmo.yml
            
            name: Deploy Demo
            
            on:
              workflow_dispatch:
            
            jobs:
              build-and-deploy:
                uses: ./.github/workflows/build-and-deploy.yml
                with:
          -       node-version: 19.x
          +       node-version: 21.x
                  environment: demo
                secrets: inherit
                permissions:
                  id-token: write
                  contents: read
          + 
          +   invalidate-cloudfront:
          +     uses: ./.github/workflows/invalidate-cloudfront.yml
          +     needs: [build-and-deploy]
          +     with:
          +       paths: "/*"
          +       environment: demo
          +     secrets: inherit
          +     permissions:
          +       id-token: write
          +       contents: read
        EOT
        id                  = "web-services-scanner/.github/workflows/deploy-dmo.yml"
        # (8 unchanged attributes hidden)
    }

  # module.repository_nuxt_web["services-scanner"].github_repository_file.files[".github/workflows/deploy-prd.yml"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            ## This file was provisioned by Terraform
            ## File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/nuxt-web/.github/workflows/deploy-prd.yml
            
            name: Deploy Production
            
            on:
              push:
                branches:
                  - main
              workflow_dispatch:
            
            jobs:
              build-and-deploy:
                uses: ./.github/workflows/build-and-deploy.yml
                with:
          -       node-version: 19.x
          +       node-version: 21.x
                  environment: production
                secrets: inherit
                permissions:
                  id-token: write
                  contents: read
            
              invalidate-cloudfront:
                uses: ./.github/workflows/invalidate-cloudfront.yml
                needs: [build-and-deploy]
                with:
                  paths: "/*"
                  environment: production
                secrets: inherit
                permissions:
                  id-token: write
                  contents: read
        EOT
        id                  = "web-services-scanner/.github/workflows/deploy-prd.yml"
        # (8 unchanged attributes hidden)
    }

  # module.repository_nuxt_web["services-scanner"].github_repository_file.files[".github/workflows/deploy-stg.yml"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/nuxt-web/.github/workflows/deploy-stg.yml
            
            name: Deploy Staging
            
            on:
              push:
                branches:
                  - staging
              workflow_dispatch:
            
            jobs:
              build-and-deploy:
                uses: ./.github/workflows/build-and-deploy.yml
                with:
          -       node-version: 19.x
          +       node-version: 21.x
                  environment: staging
                secrets: inherit
                permissions:
                  id-token: write
                  contents: read
            
              invalidate-cloudfront:
                uses: ./.github/workflows/invalidate-cloudfront.yml
                needs: [build-and-deploy]
                with:
                  paths: "/*"
                  environment: staging
                secrets: inherit
                permissions:
                  id-token: write
                  contents: read
        EOT
        id                  = "web-services-scanner/.github/workflows/deploy-stg.yml"
        # (8 unchanged attributes hidden)
    }

  # module.repository_nuxt_web["services-scanner"].github_repository_file.files["LICENSE"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            Business Source License 1.1
            
            License text copyright (c) 2017 MariaDB Corporation Ab, All Rights Reserved.
            "Business Source License" is a trademark of MariaDB Corporation Ab.
            
            -----------------------------------------------------------------------------
            
            Parameters
            
            Licensor:             Arrow DAO
            
            Licensed Work:        Arrow Services
                                  The Licensed Work is (c) 2022 Arrow DAO
            
            Additional Use Grant: Limited production uses, or as otherwise permitted by
                                  Arrow DAO governance vote
            
            Change Date:          for each release of web-services-scanner, the earlier of (i) two
                                  years from the release date, or (ii) a date specified at
                                  https://github.com/Arrow-air/web-services-scanner/blob/main/README.md
            
            Change License:       GNU Affero General Public License v3.0 or later
            
            -----------------------------------------------------------------------------
            
            Terms
            
            The Licensor hereby grants you the right to copy, modify, create derivative
            works, redistribute, and make non-production use of the Licensed Work. The
            Licensor may make an Additional Use Grant, above, permitting limited
            production use.
            
            Effective on the Change Date, or the fourth anniversary of the first publicly
            available distribution of a specific version of the Licensed Work under this
            License, whichever comes first, the Licensor hereby grants you rights under
            the terms of the Change License, and the rights granted in the paragraph
            above terminate.
            
            If your use of the Licensed Work does not comply with the requirements
            currently in effect as described in this License, you must purchase a
            commercial license from the Licensor, its affiliated entities, or authorized
            resellers, or you must refrain from using the Licensed Work.
            
            All copies of the original and modified Licensed Work, and derivative works
            of the Licensed Work, are subject to this License. This License applies
            separately for each version of the Licensed Work and the Change Date may vary
            for each version of the Licensed Work released by Licensor.
            
            You must conspicuously display this License on each original or modified copy
            of the Licensed Work. If you receive the Licensed Work in original or
            modified form from a third party, the terms and conditions set forth in this
            License apply to your use of that work.
            
            Any use of the Licensed Work in violation of this License will automatically
            terminate your rights under this License for the current and all other
            versions of the Licensed Work.
            
            This License does not grant you any right in any trademark or logo of
            Licensor or its affiliates (provided that you may use a trademark or logo of
            Licensor as expressly required by this License).
            
            TO THE EXTENT PERMITTED BY APPLICABLE LAW, THE LICENSED WORK IS PROVIDED ON
            AN "AS IS" BASIS. LICENSOR HEREBY DISCLAIMS ALL WARRANTIES AND CONDITIONS,
            EXPRESS OR IMPLIED, INCLUDING (WITHOUT LIMITATION) WARRANTIES OF
            MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, NON-INFRINGEMENT, AND
            TITLE.
            
            MariaDB hereby grants you permission to use this License’s text to license
            your works, and to refer to it using the trademark "Business Source License",
            as long as you comply with the Covenants of Licensor below.
            
            -----------------------------------------------------------------------------
            
            Covenants of Licensor
            
            In consideration of the right to use this License’s text and the "Business
            Source License" name and trademark, Licensor covenants to MariaDB, and to all
            other recipients of the licensed work to be provided by Licensor:
            
            1. To specify as the Change License the GPL Version 2.0 or any later version,
               or a license that is compatible with GPL Version 2.0 or a later version,
               where "compatible" means that software provided under the Change License can
               be included in a program with software provided under GPL Version 2.0 or a
               later version. Licensor may specify additional Change Licenses without
               limitation.
            
            2. To either: (a) specify an additional grant of rights to use that does not
               impose any additional restriction on the right granted in this License, as
               the Additional Use Grant; or (b) insert the text "None".
            
            3. To specify a Change Date.
            
            4. Not to modify this License in any other way.
            
            -----------------------------------------------------------------------------
            
            Notice
            
            The Business Source License (this document, or the "License") is not an Open
            Source license. However, the Licensed Work will eventually be made available
            under an Open Source License, as stated in this License.
        EOT
      + file                = "LICENSE"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "web-services-scanner"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["assets"].github_repository_environment.env["production"] will be updated in-place
  ~ resource "github_repository_environment" "env" {
        id          = "svc-assets:production"
        # (2 unchanged attributes hidden)

      ~ deployment_branch_policy {
          ~ custom_branch_policies = false -> true
          ~ protected_branches     = true -> false
        }
    }

  # module.repository_rust_svc["atc"].github_repository_environment.env["production"] will be updated in-place
  ~ resource "github_repository_environment" "env" {
        id          = "svc-atc:production"
        # (2 unchanged attributes hidden)

      ~ deployment_branch_policy {
          ~ custom_branch_policies = false -> true
          ~ protected_branches     = true -> false
        }
    }

  # module.repository_rust_svc["cargo"].github_repository_environment.env["production"] will be updated in-place
  ~ resource "github_repository_environment" "env" {
        id          = "svc-cargo:production"
        # (2 unchanged attributes hidden)

      ~ deployment_branch_policy {
          ~ custom_branch_policies = false -> true
          ~ protected_branches     = true -> false
        }
    }

  # module.repository_rust_svc["compliance"].github_repository_environment.env["production"] will be updated in-place
  ~ resource "github_repository_environment" "env" {
        id          = "svc-compliance:production"
        # (2 unchanged attributes hidden)

      ~ deployment_branch_policy {
          ~ custom_branch_policies = false -> true
          ~ protected_branches     = true -> false
        }
    }

  # module.repository_rust_svc["contact"].github_repository_environment.env["production"] will be updated in-place
  ~ resource "github_repository_environment" "env" {
        id          = "svc-contact:production"
        # (2 unchanged attributes hidden)

      ~ deployment_branch_policy {
          ~ custom_branch_policies = false -> true
          ~ protected_branches     = true -> false
        }
    }

  # module.repository_rust_svc["devops-test"].github_repository_environment.env["production"] will be updated in-place
  ~ resource "github_repository_environment" "env" {
        id          = "svc-devops-test:production"
        # (2 unchanged attributes hidden)

      ~ deployment_branch_policy {
          ~ custom_branch_policies = false -> true
          ~ protected_branches     = true -> false
        }
    }

  # module.repository_rust_svc["discovery"].github_repository_environment.env["production"] will be updated in-place
  ~ resource "github_repository_environment" "env" {
        id          = "svc-discovery:production"
        # (2 unchanged attributes hidden)

      ~ deployment_branch_policy {
          ~ custom_branch_policies = false -> true
          ~ protected_branches     = true -> false
        }
    }

  # module.repository_rust_svc["docs"].github_repository_environment.env["production"] will be updated in-place
  ~ resource "github_repository_environment" "env" {
        id          = "svc-docs:production"
        # (2 unchanged attributes hidden)

      ~ deployment_branch_policy {
          ~ custom_branch_policies = false -> true
          ~ protected_branches     = true -> false
        }
    }

  # module.repository_rust_svc["gis"].github_repository_environment.env["production"] will be updated in-place
  ~ resource "github_repository_environment" "env" {
        id          = "svc-gis:production"
        # (2 unchanged attributes hidden)

      ~ deployment_branch_policy {
          ~ custom_branch_policies = false -> true
          ~ protected_branches     = true -> false
        }
    }

  # module.repository_rust_svc["itest"].github_repository_environment.env["production"] will be updated in-place
  ~ resource "github_repository_environment" "env" {
        id          = "svc-itest:production"
        # (2 unchanged attributes hidden)

      ~ deployment_branch_policy {
          ~ custom_branch_policies = false -> true
          ~ protected_branches     = true -> false
        }
    }

  # module.repository_rust_svc["pricing"].github_repository_environment.env["production"] will be updated in-place
  ~ resource "github_repository_environment" "env" {
        id          = "svc-pricing:production"
        # (2 unchanged attributes hidden)

      ~ deployment_branch_policy {
          ~ custom_branch_policies = false -> true
          ~ protected_branches     = true -> false
        }
    }

  # module.repository_rust_svc["scheduler"].github_repository_environment.env["production"] will be updated in-place
  ~ resource "github_repository_environment" "env" {
        id          = "svc-scheduler:production"
        # (2 unchanged attributes hidden)

      ~ deployment_branch_policy {
          ~ custom_branch_policies = false -> true
          ~ protected_branches     = true -> false
        }
    }

  # module.repository_rust_svc["storage"].github_repository_file.files[".github/workflows/weekly.yml"] will be destroyed
  # (because key [".github/workflows/weekly.yml"] is not in for_each map)
  - resource "github_repository_file" "files" {
      - branch              = "develop" -> null
      - commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT -> null
      - commit_sha          = "133e4bbe57ba2b852797a74d6e4d3b8cc94a7539" -> null
      - content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.github/workflows/weekly.yml
            
            on:
              workflow_dispatch:
              schedule:
                - cron: '0 4 * * FRI' # run at 4 AM UTC every Friday
            
            name: Weekly Integration Test Coverage report
            
            env:
              TERM: xterm
            
            jobs:
              build_and_test:
                name: Build & Test
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                    with:
                      ref: develop
                  - name: Build
                    run: make rust-build
                  - name: Build Docker
                    run: make docker-build-dev
                  - name: Test
                    run: |
                      make rust-it-coverage | tee coverage/it.txt
                  - name: Generate coverage report
                    run: |
                      sudo apt-get -y install lcov
                      genhtml coverage/lcov.info --legend --title "${{ github.ref_name }}" --output-directory=coverage/it-report/
                  # Login to AWS and Sync docs to AWS S3 bucket
                  - name: Configure AWS Credentials
                    uses: aws-actions/configure-aws-credentials@v1
                    with:
                      role-to-assume: "arn:aws:iam::${{ secrets.AWS_ACCOUNT_WEBSITE }}:role/${{ secrets.AWS_S3_SERVICES_DOCS_ROLE }}"
                      role-session-name: arrow-rust-docs
                      aws-region: "us-east-2"
                  - name: Sync rust docs to S3 for processing
                    run: |
                      aws s3 sync ./coverage/it-report/ "s3://${{ secrets.AWS_S3_SERVICES_DOCS_BUCKET }}${{ env.AWS_S3_DOCS_RUST_DEST_PATH }}${BRANCHPATH}/it-report/"  --delete --size-only
                  - name: Generate Job summary
                    run: sed '/||/,$!d' coverage/ut.txt >> $GITHUB_STEP_SUMMARY
        EOT -> null
      - file                = ".github/workflows/weekly.yml" -> null
      - id                  = "svc-storage/.github/workflows/weekly.yml" -> null
      - overwrite_on_create = true -> null
      - ref                 = "develop" -> null
      - repository          = "svc-storage" -> null
      - sha                 = "d623c10ae20965157dbfa0f34cb75967f2d16eaf" -> null
    }

  # module.repository_rust_svc["storage"].github_repository_file.files["docker-compose-base.yml"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ---
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-svc/docker-compose-base.yml
            version: '3.8'
            
            # Define an extension with an anchor so it can be used as an alias to merge in the fields
            x-coverage: &coverage
              image: ${RUST_IMAGE_NAME}:${RUST_IMAGE_TAG}
              volumes:
                - type: bind
                  source: "${SOURCE_PATH}/"
                  target: "/usr/src/app"
                - type: bind
                  source: "${SOURCE_PATH}/.cargo/registry"
                  target: "/usr/local/cargo/registry"
              environment:
                - SERVER_HOSTNAME
                - SERVER_PORT_GRPC
                - SERVER_PORT_REST
                - RUST_BACKTRACE
              security_opt:
                - seccomp:unconfined
              command: cargo tarpaulin --manifest-path "${CARGO_MANIFEST_PATH}" --workspace -l --include-tests --tests --no-fail-fast --features ${PACKAGE_UT_FEATURES} --skip-clean -t 600 --out Lcov --output-dir coverage/
            
            services:
              web-server:
                container_name: ${DOCKER_NAME}-web-server
                image: ${PACKAGE_NAME}:${DOCKER_IMAGE_TAG}
                ports:
                  - ${HOST_PORT_REST}:${DOCKER_PORT_REST}
                  - ${HOST_PORT_GRPC}:${DOCKER_PORT_GRPC}
                healthcheck:
                  test: ["CMD", "grpc_health_probe", "-addr", "localhost:${DOCKER_PORT_GRPC}"]
                  interval: 2s
                  timeout: 1s
                  retries: 3
                  start_period: 30s
                volumes:
                  - type: bind
                    source: logs/
                    target: /logs/
                configs:
                  - source: log4rs
                    target: ${LOG_CONFIG}
                  - source: dot-env
                    target: /.env
            
              example:
                links:
                  - web-server
                depends_on:
                  web-server:
                    condition: service_healthy
                container_name: ${DOCKER_NAME}-example
                image: ${RUST_IMAGE_NAME}:${RUST_IMAGE_TAG}
                volumes:
                  - type: bind
                    source: "${SOURCE_PATH}/"
                    target: "/usr/src/app"
                  - type: bind
                    source: "${SOURCE_PATH}/.cargo/registry"
                    target: "/usr/local/cargo/registry"
                environment:
                  - SERVER_HOSTNAME
                  - SERVER_PORT_GRPC
                  - SERVER_PORT_REST
                  - EXAMPLE_TARGET
                command: cargo run --manifest-path "${CARGO_MANIFEST_PATH}" --example "${EXAMPLE_TARGET}"
            
              it-coverage: &it-coverage
                <<: *coverage
                container_name: ${DOCKER_NAME}-it-coverage
                links:
                  - web-server
                depends_on:
                  web-server:
                    condition: service_healthy
          -     command: cargo tarpaulin --manifest-path "${CARGO_MANIFEST_PATH}" --workspace -l --test integration_test --features ${PACKAGE_IT_FEATURES} -v -t 600 --out Lcov --output-dir coverage/
          +     command: cargo tarpaulin --manifest-path "${CARGO_MANIFEST_PATH}" --workspace -l --include-tests --tests --no-fail-fast --features ${PACKAGE_IT_FEATURES} --skip-clean -t 600 --out Lcov --output-dir coverage/
            
              ut-coverage: &ut-coverage
                <<: *coverage
                container_name: ${DOCKER_NAME}-ut-coverage
                command: cargo tarpaulin --manifest-path "${CARGO_MANIFEST_PATH}" --workspace -l --include-tests --tests --no-fail-fast --features ${PACKAGE_UT_FEATURES} --skip-clean -t 600 --out Lcov --output-dir coverage/
        EOT
        id                  = "svc-storage/docker-compose-base.yml"
        # (8 unchanged attributes hidden)
    }

  # module.repository_rust_svc["telemetry"].github_repository_environment.env["production"] will be updated in-place
  ~ resource "github_repository_environment" "env" {
        id          = "svc-telemetry:production"
        # (2 unchanged attributes hidden)

      ~ deployment_branch_policy {
          ~ custom_branch_policies = false -> true
          ~ protected_branches     = true -> false
        }
    }

Plan: 10 to add, 36 to change, 4 to destroy.

```

</details>

*Pusher: @owlot, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*